Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This can be a handy function for things like Easter Eggs in your games, or for unlocking seasonal content.
zh_cn: 这对于游戏中的复活节彩蛋或解锁季节性内容来说是一个非常方便的功能。

source: This can be a handy function for things like Easter Eggs in your games, or for unlocking special content.
zh_cn: 对于游戏中的复活节彩蛋或解锁特殊内容来说，这是一个非常方便的功能。

source: This can be a positive or negative value from -128 to 127 (0 is classed as positive).
zh_cn: 这个值可以是-128到127之间的正或负值(0被归为正)。

source: This can be a positive or negative value from -2,147,483,648 to 2,147,483,647 (0 is classed as positive).
zh_cn: 这个值可以是-2,147,483,648到2,147,483,647之间的正数或负数(0被归为正数)。

source: This can be a positive or negative value from -32,768 to 32,767 (0 is classed as positive).
zh_cn: 这个值可以是-32,768到32,767之间的正或负值(0被归为正)。

source: This can be a positive or negative value within the range of +/- 65504.
zh_cn: 这个值可以是+/- 65504范围内的正值或负值。

source: This can be a positive or negative value within the range of +/-16777216.
zh_cn: 该值可以是+/-16777216范围内的正或负值。

source: This can be a real value from 0 to 1 and will "smooth" the edges of these sprites.
zh_cn: 这可以是从 0 到 1 的真实值，并将"平滑"这些精灵的边缘。

source: This can be achieved by using physics_draw_debug(), which draws a schematic outline of the physical properties associated with the instance running the code.
zh_cn: 这可以通过使用physics_draw_debug()来实现，它绘制了与运行代码的实例相关联的物理属性的示意图。

source: This can be achieved by using surfaces, or by creating a sprite from the screen (the code example below shows how the effect can be achieved with surfaces).
zh_cn: 这可以通过使用表面或从屏幕上创建一个精灵来实现(下面的代码示例展示了如何使用表面实现这种效果)。

source: This can be changed at any time but will only affect behaviour when the instance is being controlled by a sequence.
zh_cn: 这可以在任何时候更改，但只会影响由序列控制的实例的行为。

source: This can be changed by setting the local anchor x/y coordinates relative to the origin of the instance, meaning that the actual connection from the instance to the physics world anchor point can be offset somewhere other than its origin.
zh_cn: 这可以通过设置相对于实例原点的本地锚点x/y坐标来改变，这意味着从实例到物理世界锚点的实际连接可以偏移到原点以外的其他地方。

source: This can be done by checking the event_type and/or the event_number (see the extended example below).
zh_cn: 这可以通过检查event_type和/或event_number来完成(参见下面的扩展示例)。

source: This can be done by converting the fixture into a sensor, which basically means that they will generate a collision event but with no physical response so that you can use these instances as "triggers" for other events to happen in the game room.
zh_cn: 这可以通过将设备转换为传感器来实现，这基本上意味着它们将产生碰撞事件，但没有物理响应，因此您可以使用这些实例作为游戏室中发生的其他事件的"触发器"。

source: This can be either a straight line path (set to 0) or a smoothed path (set to 1) in which case the path precision has to be taken into account too (the precision can be set too using path_set_precision()).
zh_cn: 这可以是直线路径(设置为0)或平滑路径(设置为1)，在这种情况下，还必须考虑路径精度(也可以使用path_set_precision()设置精度)。

source: This can be from 0 (transparent) to 1 (opaque).
zh_cn: 这可以从0(透明)到1(不透明)。

source: This can be handy when creating dynamic timelines using the timeline_moment_add_script() and timeline_moment_clear() functions, as you can check to see if a given timeline has the correct number of active moments or none at all.
zh_cn: 这在使用timeline_moment_add_script()和timeline_moment_clear()函数创建动态时间线时非常方便，因为您可以检查给定的时间线是否具有正确的活动时刻数量，还是根本没有活动时刻。

source: This can be one of the following constants:
zh_cn: 这可以是下列常量之一:

source: This can be set in the Game Options.
zh_cn: 这可以在游戏选项中设置。

source: This can be set to true to pause the simulation, or false to start it again.
zh_cn: 这可以设置为true以暂停模拟，或者设置为false以再次开始模拟。

source: This can be set with the draw_set_color() function.
zh_cn: 这可以通过draw_set_color()函数来设置。

source: This can be set with the draw_set_colour() function.
zh_cn: 这可以用draw_set_colour()函数来设置。

source: This can be used (for example) to combine multiple skins defining different pieces of clothing or accessories on a character sprite.
zh_cn: 这可用于(例如)组合多个皮肤，在角色精灵上定义不同的衣服或配饰。

source: This can be used to return the temporary directory created for your game each time it is run (the root does not contain the final "\").
zh_cn: 这可以用来返回游戏每次运行时创建的临时目录(根目录不包含最后的"\")。

source: This can be used to simulate worse network conditions for the local player.
zh_cn: 这可以用来为本地玩家模拟更差的网络条件。

source: This can be used to test whether a saved window position is going to be visible or not (the user may have disconnected an external monitor or moved the window off screen which left the window position that was saved as not being valid), for example.
zh_cn: 例如，这可用于测试保存的窗口位置是否可见(用户可能断开了外部监视器或将窗口移出屏幕，这使得保存的窗口位置无效)。

source: This can be useful if your have to iterate through the DS map looking for something, but should be avoided if possible as it can be slow.
zh_cn: 如果你不得不在DS map中迭代寻找某些东西，这可能是有用的，但是如果可能的话应该避免，因为它可能会很慢。

source: This can then be manipulated or even saved, and you can return this map to the GPU using the function gpu_set_state().
zh_cn: 然后可以对其进行操作甚至保存，并且可以使用函数gpu_set_state()将该贴图返回给GPU。

source: This can then be used along with the function skeleton_get_bounds() to retrieve data about each of the bounding boxes.
zh_cn: 然后，这可以与函数skeleton_get_bounds()一起使用，以检索关于每个边界框的数据。

source: This can then be used when mapping textures to models or primitives.
zh_cn: 这可以在将纹理映射到模型或图元时使用。

source: This cannot be used to delete sprites that are included in the game as part of the assets in the Asset Browser.
zh_cn: 这不能用于删除游戏中作为资源浏览器中资源一部分的精灵。

source: This caption appears at the top of the window, beside the game icon, when the game is not in full screen mode.
zh_cn: 当游戏不是全屏模式时，这个标题出现在窗口顶部，在游戏图标旁边。

source: This character depends on the current drawing fonts character set code page and if no font is set, it will use the default code page for the machine.
zh_cn: 该字符取决于当前绘图字体字符集代码页，如果没有设置字体，它将使用机器的默认代码页。

source: This check can be either precise or not, but for precise collisions to be enabled, the object or instance that you are checking for must also have precise collisions enabled for their sprite.
zh_cn: 该检查可以是精确的，也可以是不精确的，但是要启用精确碰撞，您正在检查的对象或实例也必须为其精灵启用精确碰撞。

source: This check will be done against the bounding box of the instance or against the mask of the instance if that instance has precise collisions checked and will return the unique instance id.
zh_cn: 如果实例检查了精确碰撞，将对实例的边界框或实例的遮罩进行检查，并将返回唯一的实例id。

source: This check will be done against the bounding box of the instance or against the mask of the instance if that instance has precise collisions checked.
zh_cn: 如果实例检查了精确碰撞，将对实例的边界框或实例的遮罩进行检查。

source: This collision can be checked as precise or not, and you may also choose to check for the instance running the code itself or not.
zh_cn: 可以检查这种碰撞是否精确，也可以选择检查运行代码本身的实例是否准确。

source: This colour represents that which will be used for those areas of the game window that are not occupied by any views.
zh_cn: 这种颜色代表游戏窗口中未被任何视图占据的区域。

source: This contact normal is a unit vector that points from one instance in the collision to another, and can be used, for example, to calculate the correct "push" direction to resolve collisions
zh_cn: 这个接触法线是一个单位向量，它从碰撞中的一个实例指向另一个实例，可以用来计算解决碰撞的正确"推"方向

source: This controls the rate at which the mip map is swapped and will generally make rendered textures blurrier the higher the value and the greater the "distance" being viewed.
zh_cn: 这控制了mip贴图交换的速率，并且通常会使渲染的纹理越模糊，值越高，查看的"距离"越大。

source: This controls the rate at which the mip map is swapped and will generally make the shader textures blurrier the higher the value and the greater the "distance" being viewed.
zh_cn: 这控制了mip贴图交换的速率，并且通常会使着色器纹理变得更模糊，值越高，查看的"距离"越大。

source: This could be useful for online projects that require a server which doesn't need to render anything.
zh_cn: 这可能对需要不需要渲染任何东西的服务器的在线项目很有用。

source: This creates a pop-up window showing a custom message, with a button labelled "Ok", and prompts the user to input an integer value.
zh_cn: 这将创建一个显示自定义消息的弹出窗口，带有一个标有"Ok"的按钮，并提示用户输入一个整数值。

source: This creates a pop-up window showing a standard message, with a button labelled "Ok", that prompts the user to input a string.
zh_cn: 这将创建一个弹出窗口，显示一条标准消息，带有一个标有"Ok"的按钮，提示用户输入一个字符串。

source: This damping ratio for the joint
zh_cn: 这个关节的阻尼比

source: This data is essentially a bit mask that contains the tile index, the flip/rotate/mirror booleans and any mask data that has been applied (see tilemap_set_mask() for details), and the resulting data value can then be used in the tile_* functions to change a tiles properties.
zh_cn: 该数据本质上是一个位掩码，其中包含瓷砖索引、翻转/旋转/镜像布尔值和任何已应用的掩码数据(详细信息请参阅tilemap_set_mask())，然后可以在tile_*函数中使用生成的数据值来更改瓷砖属性。

source: This data is returned in the forum of a DS map which contains the following key/value pairs:
zh_cn: 该数据在包含以下键/值对的DS map中返回:

source: This defines the particle as static, essentially creating it as an immovable object in the physics simulation, as they will remain in a fixed position no matter what collides with them.
zh_cn: 这将粒子定义为静态，实质上是在物理模拟中将它创建为不可移动的对象，因为无论什么与它们碰撞，它们都将保持在固定的位置。

source: This directory may or may not be visible to other applications, depending on the platform, and on the HTML5 target it will return an empty string.
zh_cn: 这个目录对其他应用程序可能可见，也可能不可见，这取决于平台，在HTML5目标上，它将返回一个空字符串。

source: This directory will hold files and can be accessed while the game is running, but it will be removed (along with all files that it contains) when the game is closed.
zh_cn: 该目录将保存文件，在游戏运行时可以访问，但当游戏关闭时，它将被删除(连同它包含的所有文件)。

source: This does NOT destroy the data-structure (for that you should use ds_list_destroy()) it only wipes all data from it and makes the list empty (zero in size).
zh_cn: 这并没有破坏数据结构(为此你应该使用ds_list_destroy())，它只是清除了所有的数据并清空了列表(大小为零)。

source: This does NOT destroy the data-structure (for that you should use ds_priority_destroy()) it only wipes all data from it and returns an empty priority queue.
zh_cn: 这不会破坏数据结构(因为你应该使用ds_priority_destroy())，它只会从数据结构中擦除所有数据并返回一个空的优先级队列。

source: This does NOT destroy the data-structure (for that you should use ds_queue_destroy()) it only wipes all data from it and returns an empty queue.
zh_cn: 这不会破坏数据结构(因为你应该使用ds_queue_destroy())，它只是擦除数据结构中的所有数据并返回一个空队列。

source: This does NOT destroy the data-structure (for that you should use ds_stack_destroy()) it only wipes all data from it and returns an empty stack.
zh_cn: 这并不破坏数据结构(为此，您应该使用ds_stack_destroy())，它只是清除其中的所有数据并返回一个空堆栈。

source: This does a check of the device for a keypad and if one is available it returns true otherwise it returns false.
zh_cn: 这将检查设备是否有键盘，如果有，则返回true，否则返回false。

source: This does not change the order the layers are rendered in and they'll still be drawn in depth order, it simply changes what z value is used.
zh_cn: 这不会改变图层渲染的顺序，它们仍然会按深度顺序绘制，它只是改变了使用的z值。

source: This does not delete the path, for that you should use path_delete(), however it should be noted that this function changes the actual path asset, and so will permanently affect how the path is used by all instances in the game from the moment the function is used until the end of the game.
zh_cn: 这不会删除路径，因为您应该使用path_delete()，但是应该注意的是，此函数改变了实际的路径资源，因此将永久地影响游戏中所有实例从使用此函数的时刻到游戏结束使用该路径的方式。

source: This does not stop the sound, and calling audio_resume_sync_group(), will start it playing from the same position it was paused at again.
zh_cn: 这不会停止声音，调用audio_resume_sync_group()将再次从暂停时的相同位置开始播放。

source: This event is triggered every step that recording takes place and will create the special DS map in the variable async_load with the following key/value pairs:
zh_cn: 该事件在记录发生的每一步都会被触发，并将在变量async_load中使用以下键/值对创建特殊的DS map:

source: This file can be either an included file or part of an extension.
zh_cn: 该文件可以是一个包含的文件，也可以是扩展的一部分。

source: This file must have been previously created using the ds_map_secure_save() function, and, when loaded, the function will return the index of the DS map that has been created from the loaded data.
zh_cn: 这个文件必须是以前使用ds_map_secure_save()函数创建的，并且在加载时，函数将返回从加载的数据创建的DS map的索引。

source: This folder does not need to be included in the filename as it is added automatically by GameMaker.
zh_cn: 这个文件夹不需要包含在文件名中，因为它是由GameMaker自动添加的。

source: This folder will be created if it doesn't exist or when you save a file using buffer_save_async().
zh_cn: 如果该文件夹不存在，或者当您使用buffer_save_async()保存文件时，将会创建该文件夹。

source: This font must have been added into the font assets of the game or have been created using either the font_add() or font_add_sprite().
zh_cn: 这种字体必须被添加到游戏的字体资源中，或者使用font_add()或font_add_sprite()创建。

source: This function Resets the display settings to the ones that were set when the game was started, but also allows you to change the current level of full screen anti-aliasing being used and whether to use vertical synchronisation.
zh_cn: 此函数将显示设置重置为游戏开始时的设置，但也允许您更改当前使用的全屏抗锯齿级别以及是否使用垂直同步。

source: This function allows a custom range definition and reverse order.
zh_cn: 此函数允许自定义范围和逆序。

source: This function allows a custom range definition.
zh_cn: 此函数允许自定义范围定义。

source: This function allows you to attach a surface to a canvas element that already exists in your web page, meaning that you can effectively split up portions of your game to be drawn at various different places within the page.
zh_cn: 此函数允许你将一个表面附加到一个已经存在于你的网页中的画布元素上，这意味着你可以有效地分割游戏的各个部分，并在网页的不同位置绘制。

source: This function allows you to control the scaling of the texture pages on load from the WAD file that is part of your final game executable.
zh_cn: 此函数允许你从WAD文件(游戏最终可执行文件的一部分)加载时控制纹理页面的缩放。

source: This function allows you to set an emitter to burst a specific type of particle and is typically used in alarms and destroy events as it is a one off code that creates the number of particles specified all at once following the distribution, shape and position set by the function part_emitter_region().
zh_cn: 此函数允许您设置发射器以爆发特定类型的粒子，通常用于警报和破坏事件，因为它是一次性代码，可根据函数part_emitter_region()设置的分布、形状和位置，一次性创建指定数量的粒子。

source: This function allows you to set an emitter to stream a specific type of particle and is typically used the create event as it is a one off code that sets the emitter to generate the number of particles specified every step of the game there-after.
zh_cn: 此函数允许你设置一个发射器来流一个特定类型的粒子，通常用于创建事件，因为它是一个一次性的代码，设置发射器来生成游戏中每一步指定数量的粒子。

source: This function also accepts the special keywords all and other and will return the keyword noone if no collision occurs or the unique ID value of the instance found if a collision does occur.
zh_cn: 此函数还接受特殊的关键字all和other，如果没有发生碰撞，它将返回关键字noone，如果发生碰撞，它将返回实例的唯一ID值。

source: This function also accepts the special keywords all and other and will return the keyword noone if no collision occurs, or the unique instance ID value of the instance found if a collision does occur.
zh_cn: 此函数还接受特殊的关键字all和other，如果没有发生碰撞，它将返回关键字noone如果发生碰撞，它将返回找到的实例的唯一实例ID值。

source: This function also accepts the special keywords all and other.
zh_cn: 此函数还接受特殊关键字all和other。

source: This function also permits you to change the scale of the sprite used (as a multiplier so that 1 is the default, 0.5 would be half and 2 would be double) and the alpha value from 0 (fully transparent) to 1 (fully opaque) for the final icon on the screen.
zh_cn: 此函数还允许你改变所使用的精灵的比例(作为乘数，1是默认值，0.5是一半，2是两倍)，以及屏幕上最终图标的alpha值从0(完全透明)到1(完全不透明)。

source: This function also supports template format strings when using "{x}" (i.e. {0},{1},...) as placeholders and passing the correspondent values as separate arguments.
zh_cn: 此函数还支持模板格式字符串，当使用"{x}"(即{0},{1},...)作为占位符并将对应的值作为单独的参数传递时。

source: This function applies an impulse locally to an instance.
zh_cn: ). 此函数将脉冲局部应用于实例。

source: This function asks you to define a rectangle within the room, and then it marks all MP grid cells "touch" that rectangle as being forbidden, meaning that the path-finding functions cannot cross them.
zh_cn: 此函数要求您在房间内定义一个矩形，然后将所有MP网格单元格“接触”该矩形标记为禁止，这意味着寻路函数不能跨越它们。

source: This function basically asks "how many 2's do you need to multiply to get n?".
zh_cn: 此函数基本上是问"你需要乘以多少个2才能得到n？"

source: This function builds a "look-at" (view) matrix based on the specified parameters listed below.
zh_cn: 此函数基于下面列出的指定参数构建一个"查看"矩阵。

source: This function builds a perspective projection matrix based on the dimensions of the near clipping plane, using the specified parameters listed below.
zh_cn: 此函数使用下面列出的指定参数，基于近剪裁平面的尺寸构建透视投影矩阵。

source: This function builds a perspective projection matrix matrix based on field of view, using the specified parameters listed below.
zh_cn: 此函数使用下面列出的指定参数，基于视场构建一个透视投影矩阵矩阵。

source: This function builds an orthographic projection matrix based on the specified parameters listed below (this is the default projection method used when you create a room in GameMaker without changing anything).
zh_cn: 此函数基于下面列出的指定参数构建一个正交投影矩阵(这是在GameMaker中创建房间时使用的默认投影方法，无需更改任何内容)。

source: This function bypasses the need to first get the sequence instance struct and permits you to access the sequence data directly.
zh_cn: 此函数绕过了首先获取序列实例结构的需要，并允许您直接访问序列数据。

source: This function calculates the distance from the edge of the bounding box of the calling instance to the nearest edge of the nearest instance of the object specified.
zh_cn: 此函数计算从调用实例的边界框边缘到指定对象的最近实例的最近边缘的距离。

source: This function calculates the distance from the edge of the bounding box of the calling instance to the specified x/y position in the room, with the return value being in pixels.
zh_cn: 此函数计算从调用实例的边界框边缘到房间中指定的x/y位置的距离，返回值以像素为单位。

source: This function can also be used for multi-dimension arrays, as long as you specify which dimension you want to get the length of when you supply the array index, following this pattern:
zh_cn: 此函数也可以用于多维数组，只要你在提供数组索引时指定你想获取哪个维度的长度，遵循以下模式:

source: This function can also be used for multi-dimension arrays, as long as you specify which dimension you want to get when you supply the array index, following this pattern:
zh_cn: 此函数也可以用于多维数组，只要你在提供数组索引时指定你想获得的维度，遵循以下模式:

source: This function can also be used for multi-dimension arrays, as long as you specify which dimension you want to set when you supply the array index, following this pattern:
zh_cn: 此函数也可以用于多维数组，只要你在提供数组索引时指定你想设置的维度，遵循以下模式:

source: This function can also be used to check if a struct reference is a weak reference or not, in which case the function will return the string "weakref" instead of the name of the function that created the struct for more information, see the function weak_ref_create()).
zh_cn: 此函数还可用于检查结构引用是否是弱引用，在这种情况下，函数将返回字符串"weakref"，而不是创建该结构的函数的名称，有关更多信息，请参阅函数weak_ref_create())。

source: This function can be used in two ways depending on what you wish to check.
zh_cn: 根据您希望检查的内容，可以以两种方式使用此函数。

source: This function can be used to "flush" a texture page or a group of texture pages, ie: remove them from VRAM when no longer required.
zh_cn: 此函数可以用来"刷新"一个纹理页面或一组纹理页面，即:当不再需要时将它们从VRAM中删除。

source: This function can be used to "freeze" a vertex buffer.
zh_cn: 此函数可以用来"冻结"一个顶点缓冲区。

source: This function can be used to "prefetch" a texture page or a group of texture pages, ie: load them into VRAM when required.
zh_cn: 此函数可以用来"预取"一个纹理页或一组纹理页，即:在需要的时候将它们加载到VRAM中。

source: This function can be used to add a font to your game from a font file present in the Included Files.
zh_cn: 此函数可以用来从包含文件中的字体文件中添加字体到游戏中。

source: This function can be used to add a given value (real or string) to all the values of the cells found within the defined area of a grid.
zh_cn: 此函数可用于将给定值(实数或字符串)添加到网格中定义区域内的所有单元格的值中。

source: This function can be used to add a given value (real or string) to all the values of the cells found within the defined disk area of a grid.
zh_cn: 此函数可用于将给定的值(实数或字符串)添加到网格中定义的圆盘区域中的所有单元格的值中。

source: This function can be used to add a given value (real or string) to the value of the given cell within the grid.
zh_cn: 此函数可用于向网格中给定单元格的值添加给定值(实数或字符串)。

source: This function can be used to add a new value (real or string) to the list, which will be added on at the end.
zh_cn: 此函数可用于向列表中添加新值(实数或字符串),该值将添加到列表的末尾。

source: This function can be used to add all the values all the cells found within the defined disk area of a grid together, as shown in the image below:
zh_cn: 此函数可以用来将网格中定义的圆盘区域内的所有单元格的所有值相加，如下图所示:

source: This function can be used to add all the values all the cells found within the defined region of a grid together, as shown in the image below:
zh_cn: 此函数可以用来将网格中定义区域内的所有单元格的所有值相加，如下图所示:

source: This function can be used to add all the values of all the cells found within the source area of a grid to the values within the destination grid, as illustrated below:
zh_cn: 此函数可用于将网格源区域内所有单元格的所有值添加到目标网格内的值，如下图所示:

source: This function can be used to change the depth of the given layer, changing the order in which its contents will be rendered to the screen.
zh_cn: 此函数可用于改变给定层的深度，改变其内容在屏幕上的呈现顺序。

source: This function can be used to change the pitch of a given sound.
zh_cn: 此函数可以用来改变给定声音的音高。

source: This function can be used to change the pitch of all sounds emitted from the given emitter.
zh_cn: 此函数可用于改变给定发射器发出的所有声音的音调。

source: This function can be used to check a variable to see if it holds a valid buffer ID value or not.
zh_cn: 此函数可以用来检查一个变量，看它是否包含一个有效的缓冲区id值。

source: This function can be used to check an object and see if it is an ancestor or not of another object.
zh_cn: 此函数可以用来检查一个对象，看它是否是另一个对象的父级。

source: This function can be used to check and see if a physical body (ie: the fixture of an instance) overlaps, or will overlap, when rotated and placed at a given position in the room.
zh_cn: 此函数可用于检查和查看物理实体(即实例的固定装置)在旋转并放置在房间中的给定位置时是否重叠或将重叠。

source: This function can be used to check and see if a variable holds an array (it will return true) or not (in which case it will return false).
zh_cn: 此函数可用于检查变量是否包含数组(它将返回true)或否(在这种情况下，它将返回false)。

source: This function can be used to check and see if a variable is a method variable (it will return true) or not (in which case it will return false).
zh_cn: 此函数可以用来检查一个变量是否是方法变量(它将返回true)或不是(在这种情况下它将返回false)。

source: This function can be used to check and see if the audio system has been initialised, or if the audio context is running.
zh_cn: 此函数可用于检查和查看音频系统是否已初始化，或者音频环境是否正在运行。

source: This function can be used to check if a given instance is currently assigned to the given layer.
zh_cn: 此函数可用于检查给定的实例当前是否被分配给给定的层。

source: This function can be used to check if a specific texture page has been unpacked and is ready for use, or if a group of texture pages have been unpacked and are ready for use.
zh_cn: 此函数可以用来检查一个特定的纹理页面是否已经解包并准备使用，或者一组纹理页面是否已经解包并准备使用。

source: This function can be used to check if any audio in a synchronised group is paused.
zh_cn: 此函数可用于检查同步组中的任何音频是否暂停。

source: This function can be used to check if any audio in a synchronised group is playing.
zh_cn: 此函数可用于检查同步组中是否有任何音频正在播放。

source: This function can be used to check if the given layer exists.
zh_cn: 此函数可以用来检查给定的层是否存在。

source: This function can be used to check if the given layer has a shader assigned to it.
zh_cn: 此函数可以用来检查给定的层是否有指定的着色器。

source: This function can be used to check the visibility of the given view port.
zh_cn: 此函数可用于检查给定视口的可见性。

source: This function can be used to check whether a given set of tile-data is for an empty tile or not.
zh_cn: 此函数可用于检查给定的一组图块数据是否用于空图块。

source: This function can be used to check whether anti-aliasing (AA) is enabled for fonts added using font_add().
zh_cn: 此函数可以用来检查使用font_add()添加的字体是否启用了抗锯齿(AA)。

source: This function can be used to check whether in a given set of tile-data the tile has been flipped or not.
zh_cn: 此函数可用于检查在给定的一组图块数据中，图块是否已被翻转。

source: This function can be used to check whether in a given set of tile-data the tile has been mirrored or not.
zh_cn: 此函数可用于检查在给定的图块数据集中图块是否已被镜像。

source: This function can be used to check whether in a given set of tile-data the tile has been rotated 90 degrees or not.
zh_cn: 此函数可用于检查在给定的一组图块数据中，图块是否旋转了90度。

source: This function can be used to check whether the matrix stack is empty (returns true) or not (returns false).
zh_cn: 此函数可用于检查矩阵堆栈是否为空(返回true)或否(返回false)。
